import {ref} from 'vue'
import {defineStore} from 'pinia'

export const useQuestionsStore = defineStore('questions', () => {
    const questions = ref([
        {
            text: 'С кем Северная Осетия не&nbsp;имеет общей границы?',
            variants: {
                a: {
                    title: 'Абхазия',
                    answer: 'Попасть на&nbsp;абхазское побережье жители Северной Осетии могут через Краснодарский край или через Грузию. Общей границы с&nbsp;солнечной Абхазией у Осетии нет, что&nbsp;вовсе не&nbsp;мешает этим двум регионам дружить.'
                },
                b: {
                    title: 'Кабардино-Балкария',
                    answer: 'На Кавказе есть гора Суган высотой в&nbsp;4487 метров. Её южные и&nbsp;восточные склоны находятся частично в&nbsp;Северной Осетии, а&nbsp;северные и&nbsp;западные – в&nbsp;Кабардино-Балкарии. Но, как говорится, умный в&nbsp;гору не&nbsp;пойдёт – добраться из&nbsp;Владикавказа в&nbsp;Нальчик можно и&nbsp;по равнине, там тоже проходит общая граница.'
                },
                c: {
                    title: 'Чеченская Республика',
                    answer: 'С Чеченской Республикой граничит Моздокский район Северной Осетии.'
                },
            },
            proper: 'a'
        },
        ////////////////////////////////////////////////////

        {
            text: 'В Куртатинском ущелье Северной Осетии расположен Аланский Успенский мужской монастырь. Какой из&nbsp;перечисленных фактов об&nbsp;этой обители верный?',
            variants: {
                a: {
                    title: 'Старейший монастырь на&nbsp;Северном Кавказе',
                    answer: 'На Северном Кавказе есть монастыри, появившиеся гораздо раньше Аланского. Например,&nbsp;Свято-Михайловский Афонский мужской монастырь, расположенный в&nbsp;Республике Адыгея, был основал в&nbsp;1877 году. А&nbsp;первые насельники Аланского Успенского мужского монастыря прибыли в&nbsp;обитель только в&nbsp;2000-м. Это молодой монастырь, но&nbsp;при&nbsp;этом – самый высокогорный на&nbsp;территории России.'
                },
                b: {
                    title: 'Самый высокогорный монастырь на&nbsp;территории России',
                    answer: 'Аланский Успенский мужской монастырь, расположен в&nbsp;горном осетинском селении Хидикус. Он возвышается на&nbsp;2000 метров над&nbsp;уровнем моря. Это самая высокогорная обитель на&nbsp;территории России.'
                },
                c: {
                    title: 'Единственный мужской монастырь на&nbsp;Северном Кавказе',
                    answer: 'Есть и&nbsp;другие мужские монастыри на&nbsp;Северном Кавказе. Например,&nbsp;Свято-Михайловский Афонский мужской монастырь в&nbsp;Республике Адыгея. Аланский же&nbsp;монастырь – самый высокогорный на&nbsp;территории России. Он расположен в&nbsp;горном осетинском селении Хидикус, на&nbsp;высоте 2000 метров над&nbsp;уровнем моря.'
                },
            },
            proper: 'b'
        },
        ////////////////////////////////////////////////////

        {
            text: 'Для чего у мужчин и&nbsp;женщин в&nbsp;осетинских танцевальных костюмах предусмотрены удлинённые рукава?',
            variants: {
                a: {
                    title: 'Так осетины демонстрировали принадлежность к высшему сословию',
                    answer: 'Скромность и&nbsp;благочестие – неотъемлемая часть осетинской культуры. Коснуться открытой части тела женщины для мужчины в&nbsp;старину считалось неприличным, а&nbsp;длинные рукава исключали такую вероятность.'
                },
                b: {
                    title: 'Чтобы мужчина и&nbsp;женщина не&nbsp;касались друг друга',
                    answer: 'Скромность и&nbsp;благочестие – неотъемлемая часть осетинской культуры. Коснуться открытой части тела женщины для мужчины в&nbsp;старину считалось неприличным, а&nbsp;длинные рукава исключали такую вероятность.'
                },
                c: {
                    title: 'Это символ незамужнего или неженатого статуса',
                    answer: 'О семейном статусе говорили другие элементы костюма. Например,&nbsp;кафтанчик, который девушка начинала носить, вступая в&nbsp;брак. Длинные же&nbsp;рукава позволяли мужчине и&nbsp;женщине не&nbsp;касаться друг друга. Дотронуться до открытой части тела женщины для мужчины в&nbsp;старину считалось неприличным.'
                },
            },
            proper: 'b'
        },
        ////////////////////////////////////////////////////


        {
            text: 'Этот российский футболист и&nbsp;тренер, уроженец Северной Осетии, в&nbsp;2018 году привёл национальную сборную к наилучшему результату за&nbsp;всю историю российского футбола – команда впервые сыграла в&nbsp;¼&nbsp;финала чемпионата мира, проходившего в&nbsp;нашей стране. Обладатель кавказских усов, он также вдохновил болельщиков на&nbsp;массовый флешмоб «Усы надежды».',
            variants: {
                a: {
                    title: 'Алан Дзагоев',
                    answer: 'Футбольным полузащитником Аланом Дзагоевым осетины гордятся по другому поводу. Например,&nbsp;он – трёхкратный чемпион России. Тренерской работой Дзагоев пока не&nbsp;занимается и&nbsp;усов не&nbsp;носит, а&nbsp;те самые «усы надежды» красуются на&nbsp;лице Станислава Черчесова. Как раз во&nbsp;главе со Станиславом Саламовичем сборная России дошла до&nbsp;¼&nbsp;финала ЧМ-2018.'
                },
                b: {
                    title: 'Валерий Газзаев',
                    answer: 'На счету этого осетина много достижений. Газзаев – самый титулованный российский тренер по числу медалей и&nbsp;кубков за&nbsp;всю историю чемпионатов России по футболу. А&nbsp;его&nbsp;роскошные усы могут посоревноваться разве что&nbsp;с&nbsp;усами другого тренера-осетина – Станислава Черчесова. Ведь Станислав Саламович и&nbsp;есть обладатель «усов надежды». Во главе с&nbsp;Черчесовым сборная России дошла до&nbsp;¼&nbsp;финала ЧМ-2018.'
                },
                c: {
                    title: 'Станислав Черчесов',
                    answer: 'Именно Станислав Черчесов своим тренерским талантом привёл сборную России к высокому результату – ¼ финала чемпионата мира. Это на&nbsp;его лице красуются те самые «усы надежды», символичное изображение которых в&nbsp;2018 году примерил на&nbsp;себя почти каждый российский болельщик. А&nbsp;вы носили «усы надежды»?'
                },
            },
            proper: 'c'
        },
        ////////////////////////////////////////////////////

        {
            text: 'Какой цвет флага Северной Осетии символизирует отвагу, силу и&nbsp;честь? ',
            variants: {
                a: {
                    title: 'Белый',
                    answer: 'Белый цвет флага символизирует духовную чистоту осетинского народа. А&nbsp;отвагу, силу и&nbsp;честь олицетворяет красный цвет.'
                },
                b: {
                    title: 'Красный',
                    answer: 'Красный цвет осетинского флага символизирует отвагу, силу и&nbsp;честь. Белый олицетворяет духовную чистоту народа. А&nbsp;жёлтый – изобилие и&nbsp;процветание.'
                },
                c: {
                    title: 'Жёлтый',
                    answer: 'Жёлтый цвет осетинского флага олицетворяет изобилие и&nbsp;процветание. А&nbsp;отвагу, силу и&nbsp;честь олицетворяет красный цвет.'
                },
            },
            proper: 'b'
        },
        ////////////////////////////////////////////////////

        {
            text: 'В горах Осетии сохранился огромный средневековый родовой замок, который в&nbsp;народе прозвали – «Фрегат». За&nbsp;что&nbsp;сооружение получило такое название?',
            variants: {
                a: {
                    title: 'Таким необычным именем звали человека, построившего замок',
                    answer: 'Местные говорят, что&nbsp;замок «Фрегат» возвёл некий человек по имени Ман-сау. По легенде этот горец видел настоящие корабли. Постройку, расположенную в&nbsp;Дигорском ущелье на&nbsp;высоте 2000 метров, прозвали фрегатом за&nbsp;внешнее сходство с&nbsp;морским судном. Это памятник федерального значения и&nbsp;одна из&nbsp;самых крупных горных построек на&nbsp;Кавказе.'
                },
                b: {
                    title: 'Проливные дожди образуют небольшое озеро, отчего создается ощущение, что&nbsp;замок — это&nbsp;фрегат на&nbsp;воде',
                    answer: 'Заполнение площади дождевой водой – это, скорее, про Венецию, но&nbsp;точно не&nbsp;про Дигорское ущелье Северной Осетии, где и&nbsp;расположена постройка. До&nbsp;моря отсюда не&nbsp;только далеко, но&nbsp;и&nbsp;высоко (2000 метров над&nbsp;уровнем моря). И всё же&nbsp;замок прозвали фрегатом – за&nbsp;внешнее сходство с&nbsp;морским судном. Это памятник федерального значения и&nbsp;одна из&nbsp;самых крупных горных построек на&nbsp;Кавказе.'
                },
                c: {
                    title: 'Замок по форме напоминает морское судно',
                    answer: 'Родовой замок «Фрегат» расположен в&nbsp;Дигорском ущелье – одном из&nbsp;самых живописных мест Северной Осетии. До&nbsp;моря отсюда не&nbsp;только далеко, но&nbsp;и&nbsp;высоко (2000 метров над&nbsp;уровнем моря). И всё же&nbsp;замок прозвали фрегатом – за&nbsp;внешнее сходство с&nbsp;морским судном. Это памятник федерального значения и&nbsp;одна из&nbsp;самых крупных горных построек на&nbsp;Кавказе.'
                },
            },
            proper: 'c'
        },
        ////////////////////////////////////////////////////

        {
            text: 'В языковой классификации к чему относится осетинский язык?',
            variants: {
                a: {
                    title: 'Индоевропейская семья, иранская группа',
                    answer: 'Язык осетин принадлежит иранской группе индоиранской ветви индоевропейских языков. В основе современного осетинского лежит язык ираноязычных аланов, предков осетин.'
                },
                b: {
                    title: 'Тюркские языки в&nbsp;составе алтайской языковой семьи',
                    answer: 'Осетинский испытал на&nbsp;себе влияние тюркских языков, но&nbsp;относится к иранской группе индоиранской ветви индоевропейских языков. В основе современного осетинского лежит язык ираноязычных аланов, предков осетин.'
                },
                c: {
                    title: 'Северокавказская языковая семья, а&nbsp;конкретнее – находящаяся внутри неё абхазо-адыгская семья',
                    answer: 'Осетинский испытал на&nbsp;себе влияние кавказских языков, но&nbsp;относится к иранской группе индоиранской ветви индоевропейских языков. Ещё первые русские и&nbsp;европейские исследователи, побывавшие на&nbsp;Кавказе, удивились отличию осетинского языка от&nbsp;языков соседних народов. В основе современного осетинского лежит язык ираноязычных аланов, предков осетин.'
                },
            },
            proper: 'a'
        },

        ////////////////////////////////////////////////////

        {
            text: 'Этот писатель-эмигрант родился в&nbsp;начале XX века в&nbsp;Санкт-Петербурге в&nbsp;осетинской семье. Большую часть жизни прожил в&nbsp;Париже, а&nbsp;умер в&nbsp;Мюнхене. Его&nbsp;прозу сравнивают с&nbsp;прозой Пруста и&nbsp;Камю. Лучшим его&nbsp;произведением многие считают первый роман – «Вечер у Клэр».',
            variants: {
                a: {
                    title: 'Тимур Кибиров',
                    answer: 'Тимур Кибиров – замечательный русский поэт, лауреат премий «Поэт» и&nbsp;«Большая книга», этнический осетин. Постмодернист, концептуалист, Кибиров дебютировал в&nbsp;печати в&nbsp;1988 году. А&nbsp;роман «Вечер у Клэр» был дебютом Гайто Газданова. Книга написана задолго до рождения Кибирова – в&nbsp;1929 году.'
                },
                b: {
                    title: 'Гайто Газданов',
                    answer: 'Эмигрировав во&nbsp;Францию после Октябрьской революции, Газданов был вынужден работать портовым грузчиком, мойщиком паровозов, слесарем на&nbsp;заводе, водителем такси. Порой, как клошар, ночевал на&nbsp;улице. Трудности не&nbsp;сломили его, а, напротив, напитали творческой энергией. Люди, которых встречал Газданов, стали прототипами литературных персонажей. В 1949 году, с&nbsp;выходом романа «Возвращение Будды», к писателю, наконец, пришёл финансовый успех. '
                },
                c: {
                    title: 'Коста Хетагуров',
                    answer: 'Коста Хетагурова считают основоположником осетинской литературы. Он родился в&nbsp;середине XIX века в&nbsp;горном осетинском селении Нар, а&nbsp;умер в&nbsp;начале XX-го века, до наступления Октябрьской революции, и, конечно, не&nbsp;относился к писателям-эмигрантам. Сочинял стихи и&nbsp;прозу на&nbsp;русском и&nbsp;осетинском языках. Писал о&nbsp;тяготах простого народа, о&nbsp;родной земле и&nbsp;о любви. Имя Коста Хетагурова носит крупнейший вуз республики – Северо-Осетинский государственный университет. А&nbsp;эмигрантскую прозу писал Гайто Газданов.'
                },
            },
            proper: 'b'
        },

        ////////////////////////////////////////////////////
        {
            text: 'Этот архитектурно-этнографический комплекс расположен в&nbsp;горах пригородного района Северной Осетии. Он состоит из&nbsp;95-ти наземных и&nbsp;полуподземных сооружений XIV-XVIII веков и&nbsp;является самым крупным на&nbsp;Кавказе в&nbsp;своей категории. Обитателей этого «города» давно нет в&nbsp;живых. Здесь обнаружено много ценных находок, рассказывающих о&nbsp;культуре и&nbsp;быте осетин. Пожалуй, самый посещаемый туристами культурный объект в&nbsp;горах Осетии.',
            variants: {
                a: {
                    title: 'Древнее селение Цымыти',
                    answer: 'Развалины средневекового горного селения Цимити также привлекают потоки туристов. Считается, что&nbsp;село основал в&nbsp;XIV веке военачальник последнего аланского царя Ос-Багатара. Однако 95 сооружений, о&nbsp;которых идёт речь – это&nbsp;склепы Даргавского некрополя. Его&nbsp;ещё называют – «Город мёртвых». Исследователи обнаружили в&nbsp;усыпальницах более 1600 предметов, среди которых одежда, украшения, оружие, предметы быта. Даргавский некрополь –памятник федерального значения.'
                },
                b: {
                    title: 'Даргавский некрополь',
                    answer: '95 сооружений, о&nbsp;которых идёт речь – это&nbsp;склепы Даргавского некрополя. Его ещё называют – «Город мёртвых». Исследователи обнаружили в&nbsp;усыпальницах более 1600 предметов, среди которых одежда, украшения, оружие, предметы быта. Даргавский некрополь –памятник федерального значения.'
                },
                c: {
                    title: 'Высокогорное село Галиат',
                    answer: 'Средневековое село Галиат расположено Дигорском ущелье. Объект представляет большую культурологическую ценность. Например,&nbsp;здесь сохранились петроглифы – древние рисунки-письмена, выбитые на&nbsp;камнях. Однако 95 сооружений, о&nbsp;которых идёт речь – это&nbsp;склепы Даргавского некрополя. Его&nbsp;ещё называют – «Город мёртвых». Исследователи обнаружили в&nbsp;усыпальницах более 1600 предметов, среди которых одежда, украшения, оружие, предметы быта. Даргавский некрополь –памятник федерального значения.'
                },
            },
            proper: 'b'
        },


        ////////////////////////////////////////////////////


        {
            text: 'Этот выдающийся русский театральный режиссёр и&nbsp;педагог родился в&nbsp;1883 году во&nbsp;Владикавказе и&nbsp;прожил там первые 20 лет своей жизни. Позже переехал в&nbsp;Москву и&nbsp;создал один из&nbsp;главных на&nbsp;сегодня столичных театров. А&nbsp;владикавказский дом режиссёра в&nbsp;2023 году, после реставрации, стал домом-музеем и&nbsp;7-й сценой московского театра, названного именем создателя.',
            variants: {
                a: {
                    title: 'Евгений Вахтангов',
                    answer: 'Евгений Вахтангов родился и&nbsp;вырос во&nbsp;Владикавказе, в&nbsp;доме на&nbsp;Армянской улице. Здание сегодня является объектом культурного наследия России. В мае 2023 года торжественно открылся отреставрированный Дом Вахтангова. Событие сопровождалось большими гастролями звёзд Вахтанговского театра и&nbsp;стало настоящим праздником для жителей Северной Осетии.'
                },
                b: {
                    title: 'Аркадий Райкин',
                    answer: 'Великий Аркадий Райкин родился в&nbsp;Риге, рос в&nbsp;Рыбинске и&nbsp;в&nbsp;Санкт-Петербурге. А&nbsp;во&nbsp;Владикавказе родился и&nbsp;вырос не&nbsp;менее великий Евгений Вахтангов. Его&nbsp;родовой дом сегодня является объектом культурного наследия России. В мае 2023 года состоялось торжественное открытие отреставрированного Дома Вахтангова. Событие сопровождалось большими гастролями звёзд Вахтанговского театра.'
                },
                c: {
                    title: 'Марк Захаров',
                    answer: 'Выдающийся советский и&nbsp;российский режиссёр театра и&nbsp;кино Марк Захаров родился в&nbsp;Москве, ровно на&nbsp;50 лет позже Евгения Вахтангова. А, вот, Вахтангов прожил свои первые 20 лет во&nbsp;Владикавказе, в&nbsp;доме на&nbsp;Армянской улице. Здание сегодня является объектом культурного наследия России. В мае 2023 года торжественно открылся отреставрированный Дома Вахтангова. Событие сопровождалось большими гастролями звёзд Вахтанговского театра.'
                },
            },
            proper: 'a'
        },


    ]);
    return {questions}
});
